IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/ECC_AGG_R5SS0_CORE0_ECC_AGG_R5SS0_CORE0.xml
<module name="ECC_AGG_R5SS0_CORE0_ECC_AGG_R5SS0_CORE0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ECC_AGG_R5SS0_CORE0_REV" acronym="ECC_AGG_R5SS0_CORE0_REV" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x24" description="RTL version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor version" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_VECTOR" acronym="ECC_AGG_R5SS0_CORE0_VECTOR" offset="0x8" width="24" description="">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete" range="24" rwaccess="RO"/> 
		<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23 - 16" rwaccess="RW"/> 
		<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS" range="15" rwaccess="RW"/> 
		<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10 - 0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_STAT" acronym="ECC_AGG_R5SS0_CORE0_STAT" offset="0xC" width="16" description="">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x28" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_WRAP_REV" acronym="ECC_AGG_R5SS0_CORE0_WRAP_REV" offset="0x10" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1700" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x0" description="RTL version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x2" description="Minor version" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_CTRL" acronym="ECC_AGG_R5SS0_CORE0_CTRL" offset="0x14" width="8" description="">
		<bitfield id="CHECK_SVBUS_TIMEOUT" width="1" begin="8" end="8" resetval="0x1" description="check for svbus timeout errors" range="8" rwaccess="RW"/> 
		<bitfield id="CHECK_PARITY" width="1" begin="7" end="7" resetval="0x1" description="check for parity errors" range="7" rwaccess="RW"/> 
		<bitfield id="ERROR_ONCE" width="1" begin="6" end="6" resetval="0x0" description="Force Error only once" range="6" rwaccess="RW"/> 
		<bitfield id="FORCE_N_ROW" width="1" begin="5" end="5" resetval="0x0" description="Force Error on any RAM read" range="5" rwaccess="RW"/> 
		<bitfield id="FORCE_DED" width="1" begin="4" end="4" resetval="0x0" description="Force Double Bit Error" range="4" rwaccess="RW"/> 
		<bitfield id="FORCE_SEC" width="1" begin="3" end="3" resetval="0x0" description="Force Single Bit Error" range="3" rwaccess="RW"/> 
		<bitfield id="ENABLE_RMW" width="1" begin="2" end="2" resetval="0x1" description="Enable rmw" range="2" rwaccess="RW"/> 
		<bitfield id="ECC_CHECK" width="1" begin="1" end="1" resetval="0x1" description="Enable ECC check" range="1" rwaccess="RW"/> 
		<bitfield id="ECC_ENABLE" width="1" begin="0" end="0" resetval="0x1" description="Enable ECC" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_ERR_CTRL1" acronym="ECC_AGG_R5SS0_CORE0_ERR_CTRL1" offset="0x18" width="32" description="">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="Row address where single or double-bit error needs to be applied. This is ignored if force_n_row is set" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_ERR_CTRL2" acronym="ECC_AGG_R5SS0_CORE0_ERR_CTRL2" offset="0x1C" width="32" description="">
		<bitfield id="ECC_BIT2" width="16" begin="31" end="16" resetval="0x0" description="Data bit that needs to be flipped if double bit error needs to be forced" range="31 - 16" rwaccess="RW"/> 
		<bitfield id="ECC_BIT1" width="16" begin="15" end="0" resetval="0x0" description="Data bit that needs to be flipped when force_sec is set" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_ERR_STAT1" acronym="ECC_AGG_R5SS0_CORE0_ERR_STAT1" offset="0x20" width="32" description="">
		<bitfield id="ECC_BIT1" width="16" begin="31" end="16" resetval="0x0" description="Data bit that corresponds to the single-bit error" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="CLR_CTRL_REG_ERR" width="1" begin="15" end="15" resetval="0x0" description="Clear control reg error Error Status, you must also re write the contorl ergister itself to clear this" range="15" rwaccess="RW"/> 
		<bitfield id="CLR_PARITY_ERR" width="2" begin="14" end="13" resetval="0x0" description="Clear parity Error Status" range="14 - 13" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="CLR_ECC_OTHER" width="1" begin="12" end="12" resetval="0x0" description="Clear other Error Status" range="12" rwaccess="RW"/> 
		<bitfield id="CLR_ECC_DED" width="2" begin="11" end="10" resetval="0x0" description="Clear Double Bit Error Status" range="11 - 10" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="CLR_ECC_SEC" width="2" begin="9" end="8" resetval="0x0" description="Clear Single Bit Error Status" range="9 - 8" rwaccess="RW
	  			 DECR"/> 
		<bitfield id="CTR_REG_ERR" width="1" begin="7" end="7" resetval="0x0" description="control register error pending, Level interrupt" range="7" rwaccess="RW"/> 
		<bitfield id="PARITY_ERR" width="2" begin="6" end="5" resetval="0x0" description="Level parity error Error Status" range="6 - 5" rwaccess="RW"/> 
		<bitfield id="ECC_OTHER" width="1" begin="4" end="4" resetval="0x0" description="successive single-bit errors have occurred while a writeback is still pending, Level interrupt" range="4" rwaccess="RW"/> 
		<bitfield id="ECC_DED" width="2" begin="3" end="2" resetval="0x0" description="Level Double Bit Error Status" range="3 - 2" rwaccess="RW
	  			 INCR"/> 
		<bitfield id="ECC_SEC" width="2" begin="1" end="0" resetval="0x0" description="Level Single Bit Error Status" range="1 - 0" rwaccess="RW
	  			 INCR"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_ERR_STAT2" acronym="ECC_AGG_R5SS0_CORE0_ERR_STAT2" offset="0x24" width="32" description="">
		<bitfield id="ECC_ROW" width="32" begin="31" end="0" resetval="0x0" description="Row address where the single or double-bit error has occurred" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_ERR_STAT3" acronym="ECC_AGG_R5SS0_CORE0_ERR_STAT3" offset="0x28" width="16" description="">
		<bitfield id="CLR_SVBUS_TIMEOUT_ERR" width="1" begin="9" end="9" resetval="0x0" description="Clear svbus timeout Error Status" range="9" rwaccess="RW"/> 
		<bitfield id="SVBUS_TIMEOUT_ERR" width="1" begin="1" end="1" resetval="0x0" description="Level svbus timeout error Error Status" range="1" rwaccess="RW"/> 
		<bitfield id="WB_PEND" width="1" begin="0" end="0" resetval="0x0" description="delayed write back pending  Status" range="0" rwaccess="RO"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_SEC_EOI_REG" acronym="ECC_AGG_R5SS0_CORE0_SEC_EOI_REG" offset="0x3C" width="0" description="">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_SEC_STATUS_REG0" acronym="ECC_AGG_R5SS0_CORE0_SEC_STATUS_REG0" offset="0x40" width="32" description="">
		<bitfield id="CPU0_KS_VIM_RAMECC_PEND" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Pending Status for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK1_PEND" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Pending Status for b1tcm0_bank1_pend" range="26" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK0_PEND" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Pending Status for b1tcm0_bank0_pend" range="25" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK1_PEND" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Pending Status for b0tcm0_bank1_pend" range="24" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK0_PEND" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Pending Status for b0tcm0_bank0_pend" range="23" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK1_PEND" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Pending Status for atcm0_bank1_pend" range="22" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK0_PEND" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Pending Status for atcm0_bank0_pend" range="21" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM7_PEND" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram7_pend" range="20" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM6_PEND" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram6_pend" range="19" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM5_PEND" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram5_pend" range="18" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM4_PEND" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram4_pend" range="17" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM3_PEND" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram3_pend" range="16" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM2_PEND" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram2_pend" range="15" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM1_PEND" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram1_pend" range="14" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM0_PEND" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Pending Status for cpu0_ddata_ram0_pend" range="13" rwaccess="RW"/> 
		<bitfield id="CPU0_DDIRTY_RAM_PEND" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Pending Status for cpu0_ddirty_ram_pend" range="12" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM3_PEND" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram3_pend" range="11" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM2_PEND" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram2_pend" range="10" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM1_PEND" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram1_pend" range="9" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM0_PEND" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Pending Status for cpu0_dtag_ram0_pend" range="8" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK3_PEND" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank3_pend" range="7" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK2_PEND" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank2_pend" range="6" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK1_PEND" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank1_pend" range="5" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK0_PEND" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Pending Status for cpu0_idata_bank0_pend" range="4" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM3_PEND" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM2_PEND" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM1_PEND" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM0_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for cpu0_itag_ram0_pend" range="0" rwaccess="RW"/>
	</register>
	<register id="ECC_AGG_R5SS0_CORE0_SEC_ENABLE_SET_REG0" acronym="ECC_AGG_R5SS0_CORE0_SEC_ENABLE_SET_REG0" offset="0x80" width="32" description="">
		<bitfield id="CPU0_KS_VIM_RAMECC_ENABLE_SET" width="1" begin="27" end="27" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ks_vim_ramecc_pend" range="27" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK1_ENABLE_SET" width="1" begin="26" end="26" resetval="0x0" description="Interrupt Enable Set Register for b1tcm0_bank1_pend" range="26" rwaccess="RW"/> 
		<bitfield id="B1TCM0_BANK0_ENABLE_SET" width="1" begin="25" end="25" resetval="0x0" description="Interrupt Enable Set Register for b1tcm0_bank0_pend" range="25" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK1_ENABLE_SET" width="1" begin="24" end="24" resetval="0x0" description="Interrupt Enable Set Register for b0tcm0_bank1_pend" range="24" rwaccess="RW"/> 
		<bitfield id="B0TCM0_BANK0_ENABLE_SET" width="1" begin="23" end="23" resetval="0x0" description="Interrupt Enable Set Register for b0tcm0_bank0_pend" range="23" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK1_ENABLE_SET" width="1" begin="22" end="22" resetval="0x0" description="Interrupt Enable Set Register for atcm0_bank1_pend" range="22" rwaccess="RW"/> 
		<bitfield id="ATCM0_BANK0_ENABLE_SET" width="1" begin="21" end="21" resetval="0x0" description="Interrupt Enable Set Register for atcm0_bank0_pend" range="21" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM7_ENABLE_SET" width="1" begin="20" end="20" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram7_pend" range="20" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM6_ENABLE_SET" width="1" begin="19" end="19" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram6_pend" range="19" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM5_ENABLE_SET" width="1" begin="18" end="18" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram5_pend" range="18" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM4_ENABLE_SET" width="1" begin="17" end="17" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram4_pend" range="17" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM3_ENABLE_SET" width="1" begin="16" end="16" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram3_pend" range="16" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM2_ENABLE_SET" width="1" begin="15" end="15" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram2_pend" range="15" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM1_ENABLE_SET" width="1" begin="14" end="14" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram1_pend" range="14" rwaccess="RW"/> 
		<bitfield id="CPU0_DDATA_RAM0_ENABLE_SET" width="1" begin="13" end="13" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddata_ram0_pend" range="13" rwaccess="RW"/> 
		<bitfield id="CPU0_DDIRTY_RAM_ENABLE_SET" width="1" begin="12" end="12" resetval="0x0" description="Interrupt Enable Set Register for cpu0_ddirty_ram_pend" range="12" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM3_ENABLE_SET" width="1" begin="11" end="11" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram3_pend" range="11" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM2_ENABLE_SET" width="1" begin="10" end="10" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram2_pend" range="10" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM1_ENABLE_SET" width="1" begin="9" end="9" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram1_pend" range="9" rwaccess="RW"/> 
		<bitfield id="CPU0_DTAG_RAM0_ENABLE_SET" width="1" begin="8" end="8" resetval="0x0" description="Interrupt Enable Set Register for cpu0_dtag_ram0_pend" range="8" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK3_ENABLE_SET" width="1" begin="7" end="7" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank3_pend" range="7" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK2_ENABLE_SET" width="1" begin="6" end="6" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank2_pend" range="6" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK1_ENABLE_SET" width="1" begin="5" end="5" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank1_pend" range="5" rwaccess="RW"/> 
		<bitfield id="CPU0_IDATA_BANK0_ENABLE_SET" width="1" begin="4" end="4" resetval="0x0" description="Interrupt Enable Set Register for cpu0_idata_bank0_pend" range="4" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM3_ENABLE_SET" width="1" begin="3" end="3" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram3_pend" range="3" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM2_ENABLE_SET" width="1" begin="2" end="2" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram2_pend" range="2" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM1_ENABLE_SET" width="1" begin="1" end="1" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram1_pend" range="1" rwaccess="RW"/> 
		<bitfield id="CPU0_ITAG_RAM0_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for cpu0_itag_ram0_pend" range="0" rwaccess="RW"/>
	</register>
